#1부터 9까지 모든 수의 합
#-----------------------------------#
i = 1
result =0

while i<=9:
  result+=i
  i+=1
print(result)
#-----------------------------------#

#1부터 9까지 홀수의 합
#-----------------------------------#
i=1
result = 0

while i<=9:
  if i%2==1:
    result+=i
  i+=1
print(result)
#-----------------------------------#

#for 반복
#-----------------------------------#
array = [11,22,33,44,55]

for i in array:
  print(i,end=" ")
  if i==5:
    print()
#-----------------------------------#

#1부터 9까지 모든 수의 합
#-----------------------------------#
result = 0
for i in range(1,10):
  result+=i
print(result)
#-----------------------------------#


#1부터 9까지 홀수의 합 (continue)
#-----------------------------------#
result = 0
for i in range(1,10):
  if i%2==0:
    continue
  result += i
print(result)
#-----------------------------------#


#1부터 5까지 차례출력 (break)
#-----------------------------------#
i=1
while i<=5:
  print(i)
  if i==5:
    break
  i+=1
#-----------------------------------#


#점수가 80점만 넘으면 합격
#-----------------------------------#
array = [90,85,77,65,97]
for i in range(5):
  if array[i]>=80:
    print(i+1,"합격")
#-----------------------------------#
array = [90,85,77,65,97]
for i in array:
  if i>=80:
    print(i+1,"합격")
#-----------------------------------#
#위의 두개는 i가 range(5),array 뭘 돌았는지
#에 대한 차이이다.


#특정 번호 학생은 제외하기
#-----------------------------------#
scores = [90,85,77,65,97]
cheating_students={2,4}

for i in range(5):
  if i+1 in cheating_students:
    continue
  if scores[i] >= 80:
    print(i+1,"합격 입니다.")
#-----------------------------------#


#구구단 예제
#-----------------------------------#
for i in range(2,10):
  for j in range(1,10):
    print(i,"*",j,"=",i*j)
  print()
#-----------------------------------#